Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetIFCType(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.IFC.ExporterIFC)
Obtains the IFC type associated to the given element for the current export.
Remarks:
IFC type names are affected by the user's entries in the mapping file set for a
given export operation.
element:
The element.
exporterIFC:
The exporter.
Returns:
The IFC type.  This is an empty string if the element should not be exported because it is not
found in the mapping file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetIFCClassName(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.IFC.ExporterIFC)
Obtains the IFC class name associated to the given element for the current export.
Remarks:
IFC class names are affected by the user's entries in the mapping file set for a
given export operation.
element:
The element.
exporterIFC:
The exporter.
Returns:
The IFC class name.  This is an empty string if the element should not be exported because it is not
found in the mapping file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetIFCClassNameByCategory(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.ExporterIFC)
Obtains the IFC class name associated to a given category id for the current export.
Remarks:
IFC class names are affected by the user's entries in the mapping file set for a
given export operation.
catId:
The category id.
exporterIFC:
The exporter.
Returns:
The IFC class name.  This is an empty string if the element should not be exported because it is not
found in the mapping file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013